Revit 2027 API
ParameterTypeId.RoofEaveCutParam Property
 "Rafter Cut"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofEaveCutParam { get; }
Public Shared ReadOnly Property RoofEaveCutParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofEaveCutParam {
	ForgeTypeId^ get ();
}
static member RoofEaveCutParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace